In [19]:
import pandas as pd

import numpy as np

In [3]:
df_datos_abc=pd.read_csv("hr_raw_data.csv",index_col=0)

In [20]:
pd.set_option('display.max_columns', None)

Nuestra misión es identificar factores clave que influyen en la satisfacción en el trabajo y en la retención de empleados

Comentarios sobre el csv:
- 1678 filas
- 41 columnas
- size: 68798
- employee number PK
- NaN = Null

Analise sobre el csv:
- relationshipsatisfaction'
- Investigar columna 'attrition'
- Investigar columna 'dailyrate'
- Investigar columna 'employeecount'
- Investigar columna 'same as monthy income'
- Distance from Home: cual es el rango?
- Education: a que nivel equipara?
- Analizar la columna years at company con la columna attrition (las dos tienen temas en comum)
- Calcular años en el role actual (years in current role) - Calcular los years at company & years since last promotion 
- Years since last promotion and years with current manager (investigar promociones internas para mandos superiores - current manager cambio o no)

In [5]:
df_datos_abc.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,...,20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,...,33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,...,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,...,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,...,19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

In [ ]:
df_datos_abc.shape # filas #columnas

(1678, 41)

In [10]:
df_datos_abc.size

68798

In [11]:
df_datos_abc.dtypes

age                          object
attrition                    object
businesstravel               object
dailyrate                   float64
department                   object
distancefromhome              int64
education                     int64
educationfield               object
employeecount                 int64
employeenumber                int64
environmentsatisfaction       int64
gender                        int64
hourlyrate                  float64
jobinvolvement                int64
joblevel                      int64
jobrole                      object
jobsatisfaction               int64
maritalstatus                object
monthlyincome                object
monthlyrate                  object
numcompaniesworked            int64
over18                       object
overtime                     object
percentsalaryhike             int64
performancerating            object
relationshipsatisfaction      int64
standardhours                object
stockoptionlevel              int64
totalworkingyears            object
trainingtimeslastyear         int64
worklifebalance              object
yearsatcompany                int64
yearsincurrentrole           object
yearssincelastpromotion       int64
yearswithcurrmanager          int64
sameasmonthlyincome          object
datebirth                     int64
salary                       object
roledepartament              object
numberchildren              float64
remotework                   object
dtype: object

In [9]:
df_datos_abc[df_datos_abc['employeenumber'] == 9]

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
8,41,No,NaN,1712.18254,NaN,2,5,NaN,1,9,...,18,NaN,11,8,"13829,17$",1982,"165950,00$",NaN,NaN,True
1656,41,No,NaN,1712.18254,NaN,2,5,NaN,1,9,...,18,NaN,11,8,"13829,17$",1982,"165950,00$",NaN,NaN,True

In [9]:
df_datos_abc.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

In [22]:
df_filtrado = df_datos_abc[['education','jobsatisfaction','yearssincelastpromotion','employeenumber']]
df_filtrado

      education  jobsatisfaction  yearssincelastpromotion  employeenumber
0             3                3                       15               1
1             4                3                       11               2
2             2                4                       11               3
3             4                3                        5               4
4             3                1                        2               5
...         ...              ...                      ...             ...
1673          3                3                        1             824
1674          4                3                        1            1087
1675          3                4                        1             528
1676          3                2                       14              76
1677          2                3                        0             401

[1678 rows x 4 columns]

In [28]:
df_id_empleado = df_filtrado.sort_values
df_id_empleado

<bound method DataFrame.sort_values of       education  jobsatisfaction  yearssincelastpromotion  employeenumber
0             3                3                       15               1
1             4                3                       11               2
2             2                4                       11               3
3             4                3                        5               4
4             3                1                        2               5
...         ...              ...                      ...             ...
1673          3                3                        1             824
1674          4                3                        1            1087
1675          3                4                        1             528
1676          3                2                       14              76
1677          2                3                        0             401

[1678 rows x 4 columns]>

In [30]:
df_filtrado = df_datos_abc[['education', 'jobsatisfaction', 'yearssincelastpromotion', 'employeenumber']]
df_filtrado = df_filtrado.sort_values(by='employeenumber')
df_filtrado

      education  jobsatisfaction  yearssincelastpromotion  employeenumber
0             3                3                       15               1
1             4                3                       11               2
2             2                4                       11               3
3             4                3                        5               4
4             3                1                        2               5
...         ...              ...                      ...             ...
1609          1                4                        3            1610
1610          2                2                        0            1611
1611          5                3                        0            1612
1612          4                4                        0            1613
1613          2                3                        0            1614

[1678 rows x 4 columns]

In [ ]:
df_datos_abc[df_datos_abc.duplicated(subset = 'employeenumber', keep = False)].sort_values('employeenumber')

orden_duplicados = df_datos_abc[df_datos_abc.duplicated(subset = 'employeenumber', keep = False)].sort_values('employeenumber')

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
8,41,No,NaN,1712.182540,NaN,2,5,NaN,1,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,NaN,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,NaN,11,8,"13829,17$",1982,"165950,00$",NaN,NaN,True
1656,41,No,NaN,1712.182540,NaN,2,5,NaN,1,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,NaN,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,NaN,11,8,"13829,17$",1982,"165950,00$",NaN,NaN,True
1652,36,No,NaN,610.174603,NaN,5,2,NaN,1,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,Y,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,NaN,3,7,"4928,33$",1987,"59140,00$",NaN,NaN,1
60,36,No,NaN,610.174603,NaN,5,2,NaN,1,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,Y,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,NaN,3,7,"4928,33$",1987,"59140,00$",NaN,NaN,1
75,47,No,travel_rarely,1032.487286,NaN,4,3,Life Sciences,1,76,3,1,NaN,2,3,maNufACTURING DIREctOr,2,Divorced,"8339,32$","21682,23$",8,NaN,Yes,12,NaN,3,Part Time,1,NaN,4,"3,0",22,NaN,14,10,"8339,32$",1976,"100071,84$",NaN,NaN,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1638,48,No,travel_rarely,417.960317,NaN,2,5,NaN,1,1568,2,1,NaN,3,2,sALES EXEcuTIVe,4,Married,"3375,83$","8777,17$",2,NaN,No,14,"3,0",1,Part Time,1,"14,0",2,"3,0",9,NaN,6,7,"3375,83$",1975,"40510,00$",NaN,NaN,True
1657,45,No,travel_rarely,495.753968,NaN,2,3,Other,1,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,NaN,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,NaN,3,7,NaN,1978,"48050,00$",NaN,NaN,False
1568,45,No,travel_rarely,495.753968,NaN,2,3,Other,1,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,NaN,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,NaN,3,7,NaN,1978,"48050,00$",NaN,NaN,False
1607,31,No,NaN,556.256661,NaN,12,3,Medical,1,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,NaN,8,5,NaN,1992,"53914,11$",NaN,NaN,True
1671,31,No,NaN,556.256661,NaN,12,3,Medical,1,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,NaN,8,5,NaN,1992,"53914,11$",NaN,NaN,True

In [39]:

df_datos_abc[df_datos_abc.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')

x = df_datos_abc[df_datos_abc.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')

In [40]:
x.duplicated().sum()

np.int64(64)

In [ ]:
x['employeenumber'].value_counts() # ID y cuantas veces estan duplicados

employeenumber
9       2
61      2
76      2
108     2
112     2
       ..
1532    2
1567    2
1568    2
1569    2
1608    2
Name: count, Length: 64, dtype: int64